---
kind: method
id: M:Autodesk.Revit.DB.Transform1D.Assign(Autodesk.Revit.DB.Transform1D)
zh: 赋值、设置值、写入
source: html/f12b0bda-b5f8-e67b-3c36-329b21bbf4ff.htm
---
# Autodesk.Revit.DB.Transform1D.Assign Method

**中文**: 赋值、设置值、写入

Assigns values from the input transformation to this transformation.

## Syntax (C#)
```csharp
public void Assign(
	Transform1D from
)
```

## Parameters
- **from** (`Autodesk.Revit.DB.Transform1D`) - The transformation to use as input.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null